In [42]:
import pandas as pd
import numpy as np

data=pd.Series([0.25,0.75,1.0])
print(data.values)
print(data.index)
print(data[1])
print(data[1:3])

[0.25 0.75 1.  ]
RangeIndex(start=0, stop=3, step=1)
0.75
1    0.75
2    1.00
dtype: float64

In [43]:
data=pd.Series([0.25,0.75,1.0],
               index=[2,5,3])#you can change the index with it
print(data)
data[5]

2    0.25
5    0.75
3    1.00
dtype: float64

0.75

In [44]:
data_2d=pd.Series([0.25,0.75,1.0],
               [1.2,2.5,3.0])#1st list is value and 2nd is index 

print(data_2d)
print(data_2d.values)
print(data_2d.index)

1.2    0.25
2.5    0.75
3.0    1.00
dtype: float64
[0.25 0.75 1.  ]
Index([1.2, 2.5, 3.0], dtype='float64')

In [45]:
# dataFrame using dict or list

lst1=[321655,64684864]
lst2=[4684878,89756464]
lst3=[687435453,645465]

pd.DataFrame([lst1,lst2,lst3],index=["Indore","Banglore","Delhi"],columns=["population","area"])

          population      area
Indore        321655  64684864
Banglore     4684878  89756464
Delhi      687435453    645465

In [46]:
lst1=["yellow",50]
lst2=["Red",25]
lst3=["orange",90]

pd.DataFrame([lst1,lst2,lst3],index=["Mango","Apple","Orange"],columns=["color","count"])

         color  count
Mango   yellow     50
Apple      Red     25
Orange  orange     90

In [47]:
pop_dict={'Indore':65468486,
          'banglore':664565,
          'delhi':654644}

area_dict={'Indore':8784,
          'banglore':65465,
          'delhi':654654}

states=pd.DataFrame({'popuation':pop_dict,
                     'area':area_dict})

states

          popuation    area
Indore     65468486    8784
banglore     664565   65465
delhi        654644  654654

In [48]:
print("Row Name:",states.index)
print("column Name:",states.columns)

Row Name: Index(['Indore', 'banglore', 'delhi'], dtype='object')
column Name: Index(['popuation', 'area'], dtype='object')

In [52]:
lst1=["xavier","mexico City",41,88.0]
lst2=["Ann","Toronto",28,79.0]
lst3=["Jans","Prague",33,81.0]
lst4=["Yi","shanghai",34,80.0]
lst5=["Robin","Manchester",38,68.0]
lst6=["Amal","Cairo",31,61.0]
lst7=["Nori","Osaka",37,84.0]

df=pd.DataFrame([lst1,lst2,lst3,lst4,lst5,lst6,lst7],index=[101,102,103,104,105,106,107],columns=["name","city","age","py-score"])
df

       name         city  age  py-score
101  xavier  mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jans       Prague   33      81.0
104      Yi     shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

In [55]:
print(df.loc[103])#loc is used for accessing row
print(df["name"])#to access column
df.city#to access column

name          Jans
city        Prague
age             33
py-score      81.0
Name: 103, dtype: object
101    xavier
102       Ann
103      Jans
104        Yi
105     Robin
106      Amal
107      Nori
Name: name, dtype: object

101    mexico City
102        Toronto
103         Prague
104       shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [57]:
#hierarchical index
index_1=[('caifornia',2000),('caifornia',2010),
       ('New York', 2000),('New York',2010),
       ('texas',2000),('texas',2010)]
population=[65465465165,6464646,
            65465465465,65464654,
            65465465456,465654]
pop=pd.Series(population,index=index_1)
pop

(caifornia, 2000)    65465465165
(caifornia, 2010)        6464646
(New York, 2000)     65465465465
(New York, 2010)        65464654
(texas, 2000)        65465465456
(texas, 2010)             465654
dtype: int64

In [59]:
pop[[i for i in pop.index if i[1]==2010]]

(caifornia, 2010)     6464646
(New York, 2010)     65464654
(texas, 2010)          465654
dtype: int64

In [60]:
index_1=pd.MultiIndex.from_tuples(index_1)
index_1

MultiIndex([('caifornia', 2000),
            ('caifornia', 2010),
            ( 'New York', 2000),
            ( 'New York', 2010),
            (    'texas', 2000),
            (    'texas', 2010)],
           )